[
    {
        "type": "chapter",
        "sections": [
            {
                "type": "section",
                "title": "being productively wrong",
                "paragraphs": [
                    {
                        "type": "paragraph",
                        "sentences": [
                            {
                                "type": "sentence",
                                "text": "At its genesis, no thing about an innovation is new.This observation will likely seem flat wrong to you."
                            },
                            {
                                "type": "sentence",
                                "text": "It did to me."
                            },
                            {
                                "type": "sentence",
                                "text": "Overand over, I dismissed it as a curious if not irritating paradox, until I finallydecided to look at it in a different way."
                            },
                            {
                                "type": "sentence",
                                "text": "Then it became a relief: that noveltywill reveal itself."
                            },
                            {
                                "type": "sentence",
                                "text": "Let me try to put that another way: Innovations accrue theirnovelty as you innovate."
                            },
                            {
                                "type": "sentence",
                                "text": "They are more easily deemed innovations in hindsight than at their beginnings."
                            },
                            {
                                "type": "sentence",
                                "text": "In hindsight they can be judged by how theyultimately empower others—a community—to achieve new things."
                            }
                        ]
                    },
                    {
                        "type": "paragraph",
                        "sentences": [
                            {
                                "type": "sentence",
                                "text": "If you accept that innovations hardly look new when you begin, you canstop searching for the next earth-shattering idea and instead just start looking around for a way to fix that thing you already suspect is not quite right.As you do, you might unknowingly start on a path to change the world."
                            }
                        ]
                    },
                    {
                        "type": "paragraph",
                        "sentences": [
                            {
                                "type": "sentence",
                                "text": "Still, something about an innovation not being new at the start feels paradoxical."
                            },
                            {
                                "type": "sentence",
                                "text": "I have come to find solace in time travel."
                            }
                        ]
                    },
                    {
                        "type": "paragraph",
                        "sentences": [
                            {
                                "type": "sentence",
                                "text": "Rewind."
                            },
                            {
                                "type": "sentence",
                                "text": "You are now in 1960."
                            },
                            {
                                "type": "sentence",
                                "text": "You’ve recently seen a great comedy, SomeLike It Hot, at the movies."
                            },
                            {
                                "type": "sentence",
                                "text": "People are still debating the “risqué” scene inwhich a man dressed as a woman kisses a woman."
                            },
                            {
                                "type": "sentence",
                                "text": "You missed it because ofthe high hairdo of the patron in front of you, but you’re still out 70 cents forthe ticket."
                            }
                        ]
                    },
                    {
                        "type": "paragraph",
                        "sentences": [
                            {
                                "type": "sentence",
                                "text": "July 8, 1960."
                            },
                            {
                                "type": "sentence",
                                "text": "You pick up the New York Times and scan the cover."
                            },
                            {
                                "type": "sentence",
                                "text": "Youread about John F. Kennedy advancing in two states ahead of the primaries;rivals dispute the claims of the “New Englander’s aides.” The story continuesbeneath the fold."
                            },
                            {
                                "type": "sentence",
                                "text": "Underneath it, in the lower left corner, a headline reads“Light Amplification Claimed by Scientist.” Next to it, near the bottom ofthe page, a big photograph of Congolese troops and demonstrators and astory about fleeing Belgians jumps out at you."
                            }
                        ]
                    },
                    {
                        "type": "paragraph",
                        "sentences": [
                            {
                                "type": "sentence",
                                "text": "You sigh."
                            },
                            {
                                "type": "sentence",
                                "text": "News as usual—politics and war."
                            },
                            {
                                "type": "sentence",
                                "text": "You put down the newspaperand decide to listen to a phonograph record."
                            }
                        ]
                    },
                    {
                        "type": "paragraph",
                        "sentences": [
                            {
                                "type": "sentence",
                                "text": "That article about the scientist, easily missed, reports on an experimentfrom May 16: physicist Theodore Maiman at the Hughes Research Laboratory focused a high-powered flash lamp on a ruby rod."
                            },
                            {
                                "type": "sentence",
                                "text": "It is the first deviceever to emit coherent light."
                            },
                            {
                                "type": "sentence",
                                "text": "Dr. Maiman just demonstrated the first workingL.A.S.E.R."
                            },
                            {
                                "type": "sentence",
                                "text": "(light amplification by stimulated emission of radiation)."
                            },
                            {
                                "type": "sentence",
                                "text": "You arestill in 1960; the significance of this news is, at best, elusive"
                            }
                        ]
                    },
                    {
                        "type": "paragraph",
                        "sentences": [
                            {
                                "type": "sentence",
                                "text": "Fast forward."
                            },
                            {
                                "type": "sentence",
                                "text": "May 6, 1964."
                            },
                            {
                                "type": "sentence",
                                "text": "On page 69 of the Times, you catch an interview with Dr. Maiman, now president of Korad, a subsidiary of UnionCarbide that builds lasers."
                            },
                            {
                                "type": "sentence",
                                "text": "He describes the laser as “a solution seeking aproblem.”"
                            }
                        ]
                    },
                    {
                        "type": "paragraph",
                        "sentences": [
                            {
                                "type": "sentence",
                                "text": "Now it’s the 1990s and you’re on your way back to the present."
                            },
                            {
                                "type": "sentence",
                                "text": "You see aTV interview with Dr. Maiman."
                            },
                            {
                                "type": "sentence",
                                "text": "He’s holding that first laser and reminiscingabout his feat:"
                            }
                        ]
                    },
                    {
                        "type": "paragraph",
                        "sentences": [
                            {
                                "type": "sentence",
                                "text": "One of the things I at least attempted to do and it did turn out to be successful was to use things that were already around."
                            },
                            {
                                "type": "sentence",
                                "text": "… If I had to develop a speciallamp that would be a whole little research project there."
                            },
                            {
                                "type": "sentence",
                                "text": "… I had a crystalthat’s not only found in nature but can be made very pure industrially."
                            },
                            {
                                "type": "sentence",
                                "text": "So, Iwas able get a hold of some rubies and just order them, buy them and havethem cut."
                            },
                            {
                                "type": "sentence",
                                "text": "The lamp I could buy [from a photographic equipment catalogue]and the rest of it is just simple machining.1"
                            }
                        ]
                    },
                    {
                        "type": "paragraph",
                        "sentences": [
                            {
                                "type": "sentence",
                                "text": "Back to the present."
                            },
                            {
                                "type": "sentence",
                                "text": "The laser is so pervasive you may not even knowyour daily routine depends heavily on its existence."
                            }
                        ]
                    },
                    {
                        "type": "paragraph",
                        "sentences": [
                            {
                                "type": "sentence",
                                "text": "It is disorienting that no part of that first laser was new."
                            },
                            {
                                "type": "sentence",
                                "text": "The laser itself,though, was."
                            },
                            {
                                "type": "sentence",
                                "text": "Theodore Maiman created his “invention” using parts he eitherfound around the lab or could order easily from a supplier."
                            },
                            {
                                "type": "sentence",
                                "text": "The laser was stilla long way from being recognizable by its name the way it is today."
                            },
                            {
                                "type": "sentence",
                                "text": "But it wasan instant innovation within several close-knit communities."
                            },
                            {
                                "type": "sentence",
                                "text": "Within weeks,several research groups were using variants of Maiman’s design."
                            },
                            {
                                "type": "sentence",
                                "text": "Shortly afterhis discovery, Maiman and some colleagues left the Hughes Research Laboratory for a company that produced ruby crystals, then founded Korad to selllasers."
                            },
                            {
                                "type": "sentence",
                                "text": "Within a few years, lasers began to be used in welding, medical research, and so on."
                            },
                            {
                                "type": "sentence",
                                "text": "One of the first applications reported for the laser outsideof research in optics appeared in 1961 in a clinical research paper assessing itsuse as a replacement for a scalpel in eye surgery."
                            }
                        ]
                    },
                    {
                        "type": "paragraph",
                        "sentences": [
                            {
                                "type": "sentence",
                                "text": "Nothing about the first laser was new—that is, not a single part, not eventhe first domain of application."
                            }
                        ]
                    },
                    {
                        "type": "paragraph",
                        "sentences": [
                            {
                                "type": "sentence",
                                "text": "Might innovating really be that simple?"
                            },
                            {
                                "type": "sentence",
                                "text": "You and your peers put someparts together?"
                            },
                            {
                                "type": "sentence",
                                "text": "Someone else, unconcerned with your parts and process,adopts your artifact and derives a benefit from its use?"
                            },
                            {
                                "type": "sentence",
                                "text": "There you go—youjust produced an innovation."
                            },
                            {
                                "type": "sentence",
                                "text": "And all you did was iteratively assemble a fewparts—some technical and some not, initially none new—in a new way, anddrive them to adoption by someone who is an expert at something else."
                            }
                        ]
                    },
                    {
                        "type": "paragraph",
                        "sentences": [
                            {
                                "type": "sentence",
                                "text": "It still took nearly two decades for the laser to find its way into a massmarket innovation like the ones we admire and have eventually come to takefor granted—specifically, as a component in bar-code readers."
                            },
                            {
                                "type": "sentence",
                                "text": "Along theway, lasers made it into innovations in all sorts of contexts, in academia, andin numerous other industries."
                            },
                            {
                                "type": "sentence",
                                "text": "In 1962, a laser pulse traveled to the moon andback for the first time."
                            },
                            {
                                "type": "sentence",
                                "text": "In 1969, the Apollo 11 mission installed the first retroreflector on the moon, and lasers have been used to measure the distancefrom Earth to the moon ever since."
                            }
                        ]
                    },
                    {
                        "type": "paragraph",
                        "sentences": [
                            {
                                "type": "sentence",
                                "text": "But that’s the laser story from the beginning."
                            },
                            {
                                "type": "sentence",
                                "text": "There is another way to tellthat story, and it is the way “innovations” are often described: working backfrom the present."
                            },
                            {
                                "type": "sentence",
                                "text": "From that perspective, the laser looks quite different."
                            },
                            {
                                "type": "sentence",
                                "text": "It isno longer a note about a scientist in the New York Times, or a “light amplification” device produced by a researcher with mostly “old” parts and nearlyno budget, or a technology that went from cover to page 69 in four years, allthe while becoming a “solution seeking a problem.” It is the laser—a technologythat revolutionized several industries and society itself, and one that we nowtake for granted."
                            },
                            {
                                "type": "sentence",
                                "text": "Looking back from the present, it is easy to imagine thedevice being interesting from the outset, to fictionalize in our heads a dramatic competition to be the first to make it happen, and to imagine manypeople working on it."
                            },
                            {
                                "type": "sentence",
                                "text": "It is a gripping tale."
                            }
                        ]
                    },
                    {
                        "type": "paragraph",
                        "sentences": [
                            {
                                "type": "sentence",
                                "text": "In fact, that story is also true."
                            },
                            {
                                "type": "sentence",
                                "text": "It is the story of how our society first encountered lasers."
                            },
                            {
                                "type": "sentence",
                                "text": "Billions of dollars were indeed spent on research and development of the laser before and after Dr. Maiman’s first laser."
                            },
                            {
                                "type": "sentence",
                                "text": "Jeff Hecht’s bookBeam2 thoroughly documents the history of the laser as a societal development emerging from a community of scientists—a “race to make the laser.”But in that version of the laser story, the specifics of how the first laser actuallyemerged become somewhat anecdotal, as though the laser was bound to happen."
                            },
                            {
                                "type": "sentence",
                                "text": "That invites a question: How significant is it that the first laser was builtout from readily accessible parts, seemingly as a scientist’s side project?"
                            }
                        ]
                    },
                    {
                        "type": "paragraph",
                        "sentences": [
                            {
                                "type": "sentence",
                                "text": "Most of the innovation stories that inspire us share one fundamentalcharacteristic: What makes them exciting is that we already know the end.They make it easy to imagine the first steps: “get an idea” and “assemble ateam.” Those are steep first steps."
                            },
                            {
                                "type": "sentence",
                                "text": "I contend, though, that the very notion that at the beginning you can even identify an innovation is specious at best.That’s why I have come to appreciate that the seemingly anecdotal story ofhow the laser actually emerged is so significant.3As you embark on innovating, the choice of which version of the laserstory to draw from for inspiration should be your own."
                            },
                            {
                                "type": "sentence",
                                "text": "Both versions derivetheir meaning from the same laser."
                            },
                            {
                                "type": "sentence",
                                "text": "You may start by putting together a fewparts to make sense of a problem that is apparent to the members of yourcommunity and perhaps to no one else, at least yet."
                            },
                            {
                                "type": "sentence",
                                "text": "Or you may try to identify the innovation that is bound to happen."
                            },
                            {
                                "type": "sentence",
                                "text": "I find the hindsight version of thestory stressful, nearly paralyzing; it seems to imply that the kickoff is anearth-shattering idea, one you get with virtually nothing to go on but yourimagination."
                            },
                            {
                                "type": "sentence",
                                "text": "Powerful as your imagination is, though, it does not hurt to aidit by giving your hands something else to do besides holding your chin."
                            },
                            {
                                "type": "sentence",
                                "text": "Iprefer to draw inspiration from the story that looks forward, in which beingwrong is as natural as getting things right."
                            }
                        ]
                    },
                    {
                        "type": "paragraph",
                        "sentences": [
                            {
                                "type": "sentence",
                                "text": "The forward-looking story of the laser suggests a strategy for innovatingthat requires only moderate foresight—a hunch—and gives you somethingto do right away: Just put some parts together."
                            },
                            {
                                "type": "sentence",
                                "text": "With the wealth of resourcesavailable online today, two-day shipping, the availability of MakerSpaces,and the increasing access to moderate amounts of seed funding, thatapproach is more achievable today than it was in Dr. Maiman’s day."
                            }
                        ]
                    },
                    {
                        "type": "paragraph",
                        "sentences": [
                            {
                                "type": "sentence",
                                "text": "Imagine yourself in the 1960s."
                            },
                            {
                                "type": "sentence",
                                "text": "You and some friends are sitting around discussing whether it could ever be possible for a group of civilians to stop theworld’s most powerful government from testing the world’s most powerfulweapon of war."
                            },
                            {
                                "type": "sentence",
                                "text": "A few years later, that is how Greenpeace will be born, afterchallenging—with a fishing boat—the US government’s plans to test nuclearweapons"
                            }
                        ]
                    },
                    {
                        "type": "paragraph",
                        "sentences": [
                            {
                                "type": "sentence",
                                "text": "In the years following 1969, more than thirty people came together invarious forms for some time, driven by a desire to make a difference about theenvironment."
                            },
                            {
                                "type": "sentence",
                                "text": "They converged at different times in several groups driven by"
                            }
                        ]
                    },
                    {
                        "type": "paragraph",
                        "sentences": [
                            {
                                "type": "sentence",
                                "text": "ecological consciousness: the Scientific Pollution and Environmental Control Society (SPEC) in Vancouver, British Columbia; theEcology Action Group in Berkeley,California; the “Green Panthers” inVancouver; the Don’t Make a WaveCommittee in Vancouver; and theSierra Club in Vancouver and California."
                            },
                            {
                                "type": "sentence",
                                "text": "This loosely bound collective wastrying to figure out what to do to bring ecology and the environment to theforefront of society, creatively, through action.At first, participants borrowed from the playbook of other ecologygroups in California and Vancouver."
                            },
                            {
                                "type": "sentence",
                                "text": "They staged creative protests, wrote columns in the press, and put up billboards in Vancouver, guided by the thought“If you can promote companies and products, you can promote ideas.”4 Thegroup even bought an old boat for ecology actions."
                            },
                            {
                                "type": "sentence",
                                "text": "It eventually sank."
                            }
                        ]
                    },
                    {
                        "type": "paragraph",
                        "sentences": [
                            {
                                "type": "sentence",
                                "text": "In the summer of 1969, the US government announced a plan to conductnuclear bomb tests on Amchitka, a volcanic island in the Aleutians off southwest Alaska."
                            },
                            {
                                "type": "sentence",
                                "text": "This announcement gave several participants a definite purpose."
                            },
                            {
                                "type": "sentence",
                                "text": "The group, led at different times by Bob and Zoe Hunter, Irving andDorothy Stowe, and Ben and Dorothy Metcalfe, set off to stop a nuclear testscheduled for the autumn of 1971."
                            },
                            {
                                "type": "sentence",
                                "text": "It would be the second such test."
                            }
                        ]
                    },
                    {
                        "type": "paragraph",
                        "sentences": [
                            {
                                "type": "sentence",
                                "text": "In 1971, members of the group chartered a small fishing boat and set sailfor Amchitka from Vancouver."
                            },
                            {
                                "type": "sentence",
                                "text": "Proceeds from a concert helped fund the trip,and several established ecology organizations supported the trip in otherways."
                            },
                            {
                                "type": "sentence",
                                "text": "During the trip, those on the boat communicated with group memberswho stayed behind via a radio at one member’s home."
                            },
                            {
                                "type": "sentence",
                                "text": "The stay-at-homemembers served as a media link."
                            },
                            {
                                "type": "sentence",
                                "text": "Two weeks after departing, well beforereaching the blast zone, the boat was intercepted by the US Coast Guard."
                            },
                            {
                                "type": "sentence",
                                "text": "Amonth later, the test went off as planned."
                            },
                            {
                                "type": "sentence",
                                "text": "They failed to stop it; they nevereven made it to the Amchitka blast zone."
                            }
                        ]
                    },
                    {
                        "type": "paragraph",
                        "sentences": [
                            {
                                "type": "sentence",
                                "text": "The failed journey, though, garnered an unexpected amount of newscoverage and support from society and politicians."
                            }
                        ]
                    },
                    {
                        "type": "paragraph",
                        "sentences": [
                            {
                                "type": "sentence",
                                "text": "That adventure began with a hunch about a social problem, billboards,membership in environmental organizations, protests, op-ed columns, aconcert, a fishing boat, a trip to Amchitka, a radio, and a link to the media.It succeeded in bringing ecology and the environment to the forefront."
                            },
                            {
                                "type": "sentence",
                                "text": "Thetrip to Amchitka brought together these “parts” in a new way and persuadedseveral of the participants that there was a sustainable path forward for anorganization concerned with a new way of engaging with ecology."
                            },
                            {
                                "type": "sentence",
                                "text": "Monthsafter the failed journey, they renamed the Don’t Make a Wave Committeethe Greenpeace Foundation."
                            }
                        ]
                    },
                    {
                        "type": "paragraph",
                        "sentences": [
                            {
                                "type": "sentence",
                                "text": "Just as with Maiman’s laser, nothing in that first trip to Amchitka wasnew."
                            },
                            {
                                "type": "sentence",
                                "text": "The combination of mostly old parts yielded something many recognized as new and impactful."
                            },
                            {
                                "type": "sentence",
                                "text": "It was, in a way, a fully working innovation prototype."
                            },
                            {
                                "type": "sentence",
                                "text": "It demonstrated a new way of engaging in ecology through action, itresonated with a much broader community, and it emerged from an embryoof an organization—a collage of organizations, actually—concerned withboth the trip and the diffusion of its meaning."
                            },
                            {
                                "type": "sentence",
                                "text": "But it was also, in a way, justthe latest and most widely successful action of an evolving group of peopleengaged in what might be described as a sequence of trial and error to find asustainable way to equate ecology and action."
                            },
                            {
                                "type": "sentence",
                                "text": "They returned absolutely convinced they had failed."
                            },
                            {
                                "type": "sentence",
                                "text": "They were wrong about their impact."
                            },
                            {
                                "type": "sentence",
                                "text": "The unexpectedresponse to their actions showed that it was not necessary to stop the USgovernment to make a difference."
                            },
                            {
                                "type": "sentence",
                                "text": "It could have stopped at that, exceptseveral members of the group were persuaded that the trip to Amchitka was,in fact, a scalable recipe for ecology in action."
                            }
                        ]
                    },
                    {
                        "type": "paragraph",
                        "sentences": [
                            {
                                "type": "sentence",
                                "text": "Their next iteration did not affect the recipe for the trip."
                            },
                            {
                                "type": "sentence",
                                "text": "Rather, the experience they accrued from participating in several ecology groups and thetrip to Amchitka informed a new organization—the Greenpeace Foundation."
                            },
                            {
                                "type": "sentence",
                                "text": "Its founding, however, did not put an end to learning through trial anderror."
                            },
                            {
                                "type": "sentence",
                                "text": "A year after the first trip, the Greenpeace III sailed toward the Mururoa Atoll to stop French atomic tests."
                            },
                            {
                                "type": "sentence",
                                "text": "This first action of the GreenpeaceFoundation was, fundamentally, a repeat of the trip to Amchitka."
                            },
                            {
                                "type": "sentence",
                                "text": "The foundersof Greenpeace reminisced in a 1996 interview5 that the problems surrounding the trip of the Greenpeace III taught their nascent organization a lot"
                            }
                        ]
                    },
                    {
                        "type": "paragraph",
                        "sentences": [
                            {
                                "type": "sentence",
                                "text": "about the legal implications of this new form of ecology action, its international ramifications, and how to recruit new activists."
                            },
                            {
                                "type": "sentence",
                                "text": "In essence, they werelearning how to bring the new thing called Greenpeace to “scale.”Their next iteration did not affect the recipe for the trip."
                            },
                            {
                                "type": "sentence",
                                "text": "Rather, the experience they accrued from participating in several ecology groups and thetrip to Amchitka informed a new organization—the Greenpeace Foundation."
                            },
                            {
                                "type": "sentence",
                                "text": "Its founding, however, did not put an end to learning through trial anderror."
                            },
                            {
                                "type": "sentence",
                                "text": "A year after the first trip, the Greenpeace III sailed toward the Mururoa Atoll to stop French atomic tests."
                            },
                            {
                                "type": "sentence",
                                "text": "This first action of the GreenpeaceFoundation was, fundamentally, a repeat of the trip to Amchitka."
                            },
                            {
                                "type": "sentence",
                                "text": "The foundersof Greenpeace reminisced in a 1996 interview5 that the problems surrounding the trip of the Greenpeace III taught their nascent organization a lot"
                            }
                        ]
                    },
                    {
                        "type": "paragraph",
                        "sentences": [
                            {
                                "type": "sentence",
                                "text": "about the legal implications of this new form of ecology action, its international ramifications, and how to recruit new activists."
                            },
                            {
                                "type": "sentence",
                                "text": "In essence, they werelearning how to bring the new thing called Greenpeace to “scale.Only in hindsight does it seem as if the founders of Greenpeace hadcome across one of those earth-shattering ideas."
                            },
                            {
                                "type": "sentence",
                                "text": "Looking forward from thebeginning, though, it seems their clarity about their group’s purpose—“ecology through action”—was not a given; rather, it emerged progressivelythrough trial and error, from actions before and after the founding of theorganization Greenpeace."
                            },
                            {
                                "type": "sentence",
                                "text": "In fact, the specific problem Greenpeace describesas its mission has evolved continuously over the years."
                            },
                            {
                                "type": "sentence",
                                "text": "And several of the organizations that shared a similar goal around the time of the founding ofGreenpeace—and at times also shared the same people—never scaled up theway Greenpeace did."
                            }
                        ]
                    },
                    {
                        "type": "paragraph",
                        "sentences": [
                            {
                                "type": "sentence",
                                "text": "The laser is generally framed as a technological innovation that first had aprofound impact in research."
                            },
                            {
                                "type": "sentence",
                                "text": "Greenpeace’s ecology in action is framed as asocial innovation."
                            },
                            {
                                "type": "sentence",
                                "text": "Their outcomes certainly are technological and social.Their beginnings imply there may be something more general about howinnovations emerge."
                            },
                            {
                                "type": "sentence",
                                "text": "We can pretend-play to time travel, but again we can seethe laser and Greenpeace as innovations only in hindsight."
                            },
                            {
                                "type": "sentence",
                                "text": "Their stories provide little in the way of specific lessons about how to innovate successfully.The only things we can say for sure about what they teach is that you need ahunch about a solution to a problem, some parts and some people, and, ultimately, a willingness to be wrong as you try to accomplish something."
                            },
                            {
                                "type": "sentence",
                                "text": "The“be wrong” part is the way to discover which parts to keep, which to discard,and which to acquire that you don’t yet have, along with which people youneed and which people you don’t as you evolve your hunch."
                            }
                        ]
                    },
                    {
                        "type": "paragraph",
                        "sentences": [
                            {
                                "type": "sentence",
                                "text": "Getting started innovating may require abandoning some preconceptions about how you think about innovations once they reach society or themarket and instead thinking of innovating as something you start to do waybefore the idea of a product or an organization eventually reveals itself."
                            },
                            {
                                "type": "sentence",
                                "text": "With that in mind, let me tell you another brief story, again from its beginning— in November 2007."
                            }
                        ]
                    },
                    {
                        "type": "paragraph",
                        "sentences": [
                            {
                                "type": "sentence",
                                "text": "It is November of 2007."
                            },
                            {
                                "type": "sentence",
                                "text": "A graduate student in computer science posts avideo on YouTube in which he explains how to modify the remote control ofa video console using an infrared sensor so that it can detect the position ofthe user’s fingers."
                            },
                            {
                                "type": "sentence",
                                "text": "The remote is held in place by a deck of cards."
                            },
                            {
                                "type": "sentence",
                                "text": "The videorefers to a website where he makes the code available for free."
                            },
                            {
                                "type": "sentence",
                                "text": "On the samewebsite, he also shares instructions on how to use the remote control of theconsole to develop an interactive whiteboard and track the user’s head todevelop virtual reality simulations."
                            },
                            {
                                "type": "sentence",
                                "text": "This is a side project, a “distraction” fromthe student’s thesis work."
                            },
                            {
                                "type": "sentence",
                                "text": "There are parts, and there is a virtual community—the YouTube audience."
                            },
                            {
                                "type": "sentence",
                                "text": "YouTube was then about two years old."
                            }
                        ]
                    },
                    {
                        "type": "paragraph",
                        "sentences": [
                            {
                                "type": "sentence",
                                "text": "Now here is the hindsight version of the story."
                            },
                            {
                                "type": "sentence",
                                "text": "In 2011, Google hired acomputer scientist by the name of Johnny Chung Lee who specialized in human–computer interaction and was best known for his work to extend thefunctionality of the remote controller for the Nintendo Wii video-gameconsole."
                            },
                            {
                                "type": "sentence",
                                "text": "He’s the same computer scientist mentioned in the preceding paragraph."
                            },
                            {
                                "type": "sentence",
                                "text": "In between posting the video and his employment at Google, heworked at Microsoft, joining as a core team member of the project that cameto be known as Kinect."
                            },
                            {
                                "type": "sentence",
                                "text": "You can get the full “story,” backwards, at any numberof websites."
                            }
                        ]
                    },
                    {
                        "type": "paragraph",
                        "sentences": [
                            {
                                "type": "sentence",
                                "text": "In the years since Johnny Chung Lee’s innovation, the Kinect has cometo be used in personal fitness, video games for dancing, and a number ofother action-based video games."
                            },
                            {
                                "type": "sentence",
                                "text": "Video games and fitness, once not even remotely connected, are today intertwined."
                            },
                            {
                                "type": "sentence",
                                "text": "That, though, is something youcan only know after the fact."
                            },
                            {
                                "type": "sentence",
                                "text": "Still, it doesn’t stop people from pointing to theKinect story as an example of a “truism” about innovation: focus on the user.Of course, it’s a lot easier to do that when you have a clear image of the endproduct than when you are making an early YouTube video."
                            },
                            {
                                "type": "sentence",
                                "text": "In the formercase, the user is obvious; in the latter, the user is fictional—at best, anotherenthusiast."
                            },
                            {
                                "type": "sentence",
                                "text": "But that didn’t prevent Johnny Chung Lee from diffusing his innovation and being recruited into a Microsoft team."
                            }
                        ]
                    }
                ]
            }
        ]
    }
]